<a href="https://colab.research.google.com/github/fabioeomedeiros/Data-Science-Base/blob/main/09_Dados_faltantes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Dados Faltantes

### Importando as bibliotecas nescessárias
 - Numpy
 - Pandas
 - Matplotlib

 $$ -\nabla U(\boldsymbol{\mathrm{r}}) = m\frac{\mathrm{d}^2\boldsymbol{\mathrm{r}}(t)}{\mathrm{d}\boldsymbol{\mathrm{t}}^2} $$

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

### Importando tabela externa como DataFrame interno

In [6]:
dados = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/Data Science/Datas/athlete_events.csv')
print(dados.describe())
dados.head()

                  ID            Age  ...         Weight           Year
count  271116.000000  261642.000000  ...  208241.000000  271116.000000
mean    68248.954396      25.556898  ...      70.702393    1978.378480
std     39022.286345       6.393561  ...      14.348020      29.877632
min         1.000000      10.000000  ...      25.000000    1896.000000
25%     34643.000000      21.000000  ...      60.000000    1960.000000
50%     68205.000000      24.000000  ...      70.000000    1988.000000
75%    102097.250000      28.000000  ...      79.000000    2002.000000
max    135571.000000      97.000000  ...     214.000000    2016.000000

[8 rows x 5 columns]

   ID                      Name  ...                             Event  Medal
0   1                 A Dijiang  ...       Basketball Men's Basketball    NaN
1   2                  A Lamusi  ...      Judo Men's Extra-Lightweight    NaN
2   3       Gunnar Nielsen Aaby  ...           Football Men's Football    NaN
3   4      Edgar Lindenau Aabye  ...       Tug-Of-War Men's Tug-Of-War   Gold
4   5  Christine Jacoba Aaftink  ...  Speed Skating Women's 500 metres    NaN

[5 rows x 15 columns]

### Excluindo dados faltantes com a função .dropna()

In [10]:
dados_na = dados.dropna()
# print(dados_na.describe())
dados_na.head()

    ID  ...   Medal
40  16  ...  Bronze
41  17  ...  Bronze
42  17  ...    Gold
44  17  ...    Gold
48  17  ...    Gold

[5 rows x 15 columns]

### Descobrindo os dados faltantes com a função .isnull()

In [9]:
dados_null = dados.isnull()
# print(dados_null.describe())
dados_null.head()

      ID   Name    Sex    Age  Height  ...  Season   City  Sport  Event  Medal
0  False  False  False  False   False  ...   False  False  False  False   True
1  False  False  False  False   False  ...   False  False  False  False   True
2  False  False  False  False    True  ...   False  False  False  False   True
3  False  False  False  False    True  ...   False  False  False  False  False
4  False  False  False  False   False  ...   False  False  False  False   True

[5 rows x 15 columns]

### Descobrindo quantos dados faltantes cada coluna possui com a função .isnull().sum()

In [18]:
dados_faltantes = dados.isnull().sum()
# print(dados_faltantes.describe())
dados_faltantes.head(15)

ID             0
Name           0
Sex            0
Age         9474
Height     60171
Weight     62875
Team           0
NOC            0
Games          0
Year           0
Season         0
City           0
Sport          0
Event          0
Medal     231333
dtype: int64

In [23]:
print(len(dados['ID']))
dados_faltantes_p = (dados.isnull().sum() / len(dados['ID']))*100
dados_faltantes_p.head(15)

271116

ID         0.000000
Name       0.000000
Sex        0.000000
Age        3.494445
Height    22.193821
Weight    23.191180
Team       0.000000
NOC        0.000000
Games      0.000000
Year       0.000000
Season     0.000000
City       0.000000
Sport      0.000000
Event      0.000000
Medal     85.326207
dtype: float64

### Preenchendo dados faltantes

In [33]:
dados['Medal'] = dados['Medal'].fillna('None') #Preenchendo e atribuindo com a informação (string) 'None'
dados['Age'] = dados['Age'].fillna(dados['Age'].mean()) #Preenchendo e atribuindo com a média das idades
dados['Height'] = dados['Height'].fillna(dados['Height'].mean()) #Preenchendo e atribuindo com a média das alturas
dados['Weight'] = dados['Weight'].fillna(dados['Weight'].mean()) #Preenchendo e atribuindo com a média das massas
dados.head()

   ID                      Name  ...                             Event  Medal
0   1                 A Dijiang  ...       Basketball Men's Basketball   None
1   2                  A Lamusi  ...      Judo Men's Extra-Lightweight   None
2   3       Gunnar Nielsen Aaby  ...           Football Men's Football   None
3   4      Edgar Lindenau Aabye  ...       Tug-Of-War Men's Tug-Of-War   Gold
4   5  Christine Jacoba Aaftink  ...  Speed Skating Women's 500 metres   None

[5 rows x 15 columns]

In [36]:
dados.isnull().sum()
# print(dados.shape)

ID        0
Name      0
Sex       0
Age       0
Height    0
Weight    0
Team      0
NOC       0
Games     0
Year      0
Season    0
City      0
Sport     0
Event     0
Medal     0
dtype: int64